Tekla Open API Reference for Tekla Structures 2025
PrintAttributes.Orientation Property
 The print orientation type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DotPrintOrientationType Orientation { get; set; }
Public Property Orientation As DotPrintOrientationType
	Get
	Set
Property Value
Type: DotPrintOrientationType
See Also
Reference
PrintAttributes Class
Tekla.Structures.Drawing Namespace